Revit 2027 API
ScheduleFilter.GetStringValue Method
 Gets the filter value for a filter using a string value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetStringValue()
Public Function GetStringValue As String
public:
String^ GetStringValue()
member GetStringValue : unit -> string
Return Value
String
 The filter value.
Exceptions
Exception | Condition
InvalidOperationException |  The filter value is not a string.
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace